# Excel and CSV to Pandas and NumPy
This laboratory aime to create dataframes with pandas from kaggle dataset [Ding Tai Fung x Online Ordering Platform Orders](https://www.kaggle.com/datasets/aizakpan/ding-tai-fung-x-online-ordering-platform-orders?select=detail.csv).  

The dataset has 3 cvs files, but I transformed the detail.cvs file to xlsx MS Excel format in order to show how to work with Excels files.

From detail.xlsx file it will be create a dataframe and add it more columns from menu.cvs and order.csv files, linked by order_id and item_id.

NumPy will allow to create new columns using conditional (where clause) and new dataframes using aggregate functions (sum).

Importing pandas an numpy,

In [1]:
import pandas as pd
import numpy as np

Creating dataframe from detail.xlsx (openpyxl is required),

In [3]:
detaildf = pd.read_excel("detail.xlsx")

First 5 rows of detaildf,

In [4]:
detaildf.head(5)

   order_id  item_id  price
0     10001       93     70
1     10001      677    230
2     10001       97    100
3     10002       31    190
4     10002       72    270

Last 5 rows of detaildf,

In [5]:
detaildf.tail(5)

       order_id  item_id  price
14679     13829       72    270
14680     13829       67    370
14681     13829       67    370
14682     13829       97    100
14683     13829       73    250

Importing csv files to dataframes: menu and order,

In [6]:
menudf = pd.read_csv('menu.csv')

In [7]:
orderdf = pd.read_csv('order.csv')

First 5 elements of menudf and orderdf dataframes,

In [8]:
menudf.head(5)

,product_id,product_name,category,price
0,66,Pork Xiaolongbao,Xiaolongbao,220
1,67,Crab Roe and Pork Xiaolongbao,Xiaolongbao,370
2,677,Chicken Xiaolongbao,Xiaolongbao,230
3,665,Green Squash and Shrimp Xiaolongbao,Xiaolongbao,340
4,71,Steamed Vegetable and Ground Pork Dumplings,Dumplings & Shao Mai,220

In [9]:
orderdf.head(5)

         date  order_id  total
0  2023-01-01     10001    400
1  2023-01-01     10002    750
2  2023-01-01     10003   1020
3  2023-01-01     10004    780
4  2023-01-01     10005   1000

Using NumPy, a new colum "Price Det." is added to the detaildf dataframe, this column classifies items as "Expensive" if price exeeds 230 otherwise it's label them as "Cheap",

In [10]:
detaildf['Price Det.'] = np.where(detaildf['price']>230,'Expensive','Cheap')

First 5 elements of detaildf dataframe with the new column "Price Det.",

In [11]:
detaildf.head(5)

   order_id  item_id  price Price Det.
0     10001       93     70      Cheap
1     10001      677    230      Cheap
2     10001       97    100      Cheap
3     10002       31    190      Cheap
4     10002       72    270  Expensive

Rename "Price Det." column of "detaildf" to "Price Class.",

In [13]:
detaildf = detaildf.rename(columns={'Price Det.':'Price Cassi.'})

In [14]:
detaildf.head(5)

   order_id  item_id  price Price Cassi.
0     10001       93     70        Cheap
1     10001      677    230        Cheap
2     10001       97    100        Cheap
3     10002       31    190        Cheap
4     10002       72    270    Expensive

Merging orderdf and detaildf dataframes into a single dataframe named "orderdetaildf",

In [15]:
orderdetaildf = detaildf.merge(orderdf, on =['order_id'], how='left')

First 5 elements of "orderdetaildf". It's the same detaildf dataframe with 2 more columns: date and total,

In [16]:
orderdetaildf.head(5)

   order_id  item_id  price Price Cassi.        date  total
0     10001       93     70        Cheap  2023-01-01    400
1     10001      677    230        Cheap  2023-01-01    400
2     10001       97    100        Cheap  2023-01-01    400
3     10002       31    190        Cheap  2023-01-01    750
4     10002       72    270    Expensive  2023-01-01    750

Finding the single dates of "orderdetaildf" into a "datesdf" dataframe,

In [17]:
datedf = orderdetaildf['date']

First 5 elements of datedf dataframe,

In [18]:
datedf.head(5)

0    2023-01-01
1    2023-01-01
2    2023-01-01
3    2023-01-01
4    2023-01-01
Name: date, dtype: object

Using drop_duplicates() method to get uniques elements of datedf dataframe,

In [21]:
datedf = datedf.drop_duplicates()

Retrieve the first 5 elements of the datedf dataframe after removing duplicate entries,

In [22]:
datedf.head(5)

0      2023-01-01
100    2023-01-02
198    2023-01-03
288    2023-01-04
390    2023-01-05
Name: date, dtype: object